/*
 * 1.3.c
 *
 * Created: 6/12/2014 11:46:29 μμ
 *  Author: Rafail
 */ 


#include <avr/io.h>
#define CHAR_BIT 8

int main(void)
{
	DDRD = 0x00;																	/*η θύρα PORTD είναι είσοδος*/
	DDRB = 0xFF;																	/*η θύρα PORTB είναι έξοδος*/
	unsigned char output = 0x01;													/*αρχικοποίηση εξόδου (το δεξιότερο led αναμμένο)*/
	PORTB = output;																	/*έξοδος στην PORTB*/
	unsigned char x;																/*προσωρινή μεταβλητή 8-bit*/
	unsigned char flag0 = 0, flag1 = 0, flag2 = 0, flag3 = 0, flag4 = 0;
																					/*αρχικοποίηση σημαιών ενεργοποίησης SW0, SW1, SW2, SW3, SW4*/
	while(1)																		/*συνεχής λειτουργία*/
	{
		x = PIND & 0x10;															/*απομόνωση bit4 της PORTD*/
		if (x!=0)																	/*αν SW4 πατημένο (bit4(PORTD) = 1)*/
		{
			if (!flag4)																/*τότε αν πατήθηκε μόλις τώρα (flag4 = 0) κάνε τη λειτουργία*/
			{
				output = 0x01;														/*επαναφορά του led στην αρχική του θέση*/
				PORTB = output;
				flag4 = 1;															/*και θέσε τη σημαία ενεργοποίησης στο 1*/
			}
		}
		else																		/*αλλιώς αν το SW4 δεν είναι πατημένο*/
		{
			flag4 = 0;																/*θέσε την flag4 στο 0*/
			x = PIND & 0x08;														/*και απομόνωση bit3 της PORTD*/
			if (x!=0)																/*αν SW3 πατημένο (bit3(PORTD) = 1)*/
			{
				if (!flag3)															/*τότε αν πατήθηκε μόλις τώρα (flag3 = 0) κάνε τη λειτουργία*/
				{
					output = (output>>2) | (output << (CHAR_BIT - 2));				/*περιστροφή του led 2 θέσεις δεξιά*/
					PORTB = output;													/*έξοδος στην PORTB*/
					flag3 = 1;														/*και θέσε τη σημαία ενεργοποίησης στο 1*/
				}
			}
			else																	/*αλλιώς αν το SW3 δεν είναι πατημένο*/
			{
				flag3 = 0;															/*θέσε την flag3 στο 0*/
				x = PIND & 0x04;													/*και απομόνωση bit2 της PORTD*/
				if (x!=0)															/*αν SW2 πατημένο (bit2(PORTD) = 1)*/
				{
					if (!flag2)														/*τότε αν πατήθηκε μόλις τώρα (flag2 = 0) κάνε τη λειτουργία*/
					{
						output = (output<<2) |(output >> (CHAR_BIT - 2));			/*περιστροφή του led 2 θέσεις αριστερά*/
						PORTB = output;												/*έξοδος στην PORTB*/
						flag2 = 1;													/*και θέσε τη σημαία ενεργοποίησης στο 1*/
					}
				}
				else																/*αλλιώς αν το SW2 δεν είναι πατημένο*/
				{
					flag2 = 0;														/*θέσε την flag2 στο 0*/
					x = PIND & 0x02;												/*και απομόνωση bit1 της PORTD*/
					if (x!=0)														/*αν SW1 πατημένο (bit1(PORTD) = 1)*/
					{
						if (!flag1)													/*τότε αν πατήθηκε μόλις τώρα (flag1 = 0) κάνε τη λειτουργία*/
						{
							output = (output>>1) | (output << (CHAR_BIT - 1));		/*περιστροφή του led 1 θέση δεξιά*/
							PORTB = output;											/*έξοδος στην PORTB*/
							flag1 = 1;												/*και θέσε τη σημαία ενεργοποίησης στο 1*/
						}
					}
					else															/*αλλιώς αν το SW1 δεν είναι πατημένο*/
					{
						flag1 = 0;													/*θέσε την flag1 στο 0*/
						x = PIND & 0x01;											/*και απομόνωση bit0 της PORTD*/
						if (x!=0)													/*αν SW0 πατημένο (bit0(PORTD) = 1)*/
						{
							if(!flag0)												/*τότε αν πατήθηκε μόλις τώρα (flag0 = 0) κάνε τη λειτουργία*/
							{
								output = (output<<1) | (output >> (CHAR_BIT - 1));	/*περιστροφή του led 1 θέση αριστερά*/
								PORTB = output;										/*έξοδος στην PORTB*/
								flag0 = 1;											/*και θέσε τη σημαία ενεργοποίησης στο 1*/
							}
							} else flag0 = 0;										/*αλλιώς αν το SW0 δεν είναι πατημένο θέσε την flag0 στο 0 */
						}
					}
				}
			}
		}
	}